// test/mock.test.ts
import { Group } from "@/entities/group/types";

export const initialGroups: Group[] = [
  {
    id: "g1",
    name: "1ИСП11‑45",
    isExpanded: false,
    disciplines: {
      1: [
        { id: "d1", title: "Проектирование баз данных" },
        { id: "d2", title: "Проектирование баз данных" },
        { id: "d3", title: "Проектирование баз данных" },
        { id: "d4", title: "Проектирование баз данных" },
        { id: "d5", title: "Проектирование баз данных" },
        { id: "d6", title: "Проектирование баз данных" },
        { id: "d7", title: "Проектирование баз данных" },
        { id: "d8", title: "Проектирование баз данных" },
        { id: "d9", title: "Проектирование баз данных" },
        { id: "d10", title: "Проектирование баз данных" },
        { id: "d11", title: "Проектирование баз данных" },
        { id: "d12", title: "Проектирование баз данных" },
        { id: "d13", title: "Проектирование баз данных" },
        { id: "d14", title: "Проектирование баз данных" },
        { id: "d15", title: "Проектирование баз данных" },
        { id: "d16", title: "Проектирование баз данных" },
        { id: "d17", title: "Проектирование баз данных" },
      ],
      2: [{ id: "d2", title: "Интернет‑технологии" }],
    },
  },
  {
    id: "g2",
    name: "2ИСП9‑45",
    isExpanded: false,
    disciplines: { 1: [], 2: [{ id: "d3", title: "Интернет‑технологии" }] },
  },
];
